newwms_gift/src/InformationRegisters/итWMSКорзинаНоменклатуры/итWMSКорзинаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>итWMSКорзинаНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>КлючДанных</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>170</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.итСкладскиеЯчейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Качество</name>
    <type>
      <types>CatalogRef.Качество</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

newwms_gift/src/InformationRegisters/итWMSКорзинаНоменклатуры/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	ДатаПроверки=ТекущаяДата()-(60*60*25);
	Если  ЭтотОбъект.ДополнительныеСвойства.Свойство("ТехническаяЗапись") тогда
		Если  ЭтотОбъект.ДополнительныеСвойства.ТехническаяЗапись тогда
			Возврат
		КонецЕсли;
	КонецЕсли;
	
	
	//Очистка устаревшений данных
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	итWMSКорзинаНоменклатуры.КлючДанных
		|ИЗ
		|	РегистрСведений.итWMSКорзинаНоменклатуры КАК итWMSКорзинаНоменклатуры
		|ГДЕ
		|	итWMSКорзинаНоменклатуры.ДатаЗаписи < &ДатаПроверки
		|
		|СГРУППИРОВАТЬ ПО
		|	итWMSКорзинаНоменклатуры.КлючДанных";
	
	Запрос.УстановитьПараметр("ДатаПроверки", ДатаПроверки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	НабораЗаписей=РегистрыСведений.итWMSКорзинаНоменклатуры.СоздатьНаборЗаписей();
	НабораЗаписей.Отбор.КлючДанных.Установить(ВыборкаДетальныеЗаписи.КлючДанных);
	НабораЗаписей.Прочитать();
	НабораЗаписей.ДополнительныеСвойства.Вставить("ТехническаяЗапись",Истина);
	НабораЗаписей.Очистить();
	НабораЗаписей.Записать();
	КонецЦикла;
	


КонецПроцедуры
